# -*- coding: utf-8 -*-
# author:shihua
# coder:shihua
# 这是一个模板功能实现模块，主要技术采用jinja2
"""
模块介绍
-------

这是一个模板功能实现模块，主要技术采用jinja2

设计模式：

    （1）无   

关键点：    

    （1）jinja2  

主要功能：            

    （1）模板功能                                                    

使用示例
-------


类说明
------

"""



####### 载入程序包 ##########################################################
############################################################################



from jinja2 import Environment, FileSystemLoader



####### 模板功能模块 ########################################################
### 设计模式：                                                           ###
### （1）无                                                              ###
### 关键点：                                                             ###
### （1）jinja2                                                          ###
### 主要功能：                                                           ###
### （1）模板功能                                                         ###
############################################################################



###### 基础模块类 #####################################################################
######################################################################################




def gen_jinja2(searchpath,template_name,render_paras_dict,gen_file):
    """
    函数功能：

        定义一个根据模板文件渲染生成目标文件的jinja2生成函数

    参数：
        searchpath (str): 搜索路径
        template_name (str): 模板文件名称
        render_paras_dict (Dict): 渲染参数字典
        gen_file (str): 生成文件路径

    返回：
        无
    """

    env = Environment(loader=FileSystemLoader(searchpath=searchpath))
    template = env.get_template(template_name)
    output = template.render(render_paras_dict)
    with open(gen_file,'w',encoding='utf8') as out:
        out.write(output)
    print("Jinja2 generate done!")



#########################################################################################
#########################################################################################


