# -*- coding: utf-8 -*-
# author:shihua
# coder:shihua
# 这是一个算法应用组件的具体实现函数接口类，主要提供各种功能的具体实现
"""
模块介绍
-------

这是一个算法应用组件的具体实现函数接口类，主要提供各种功能的具体实现

设计模式：

    （1）无   

关键点：    

    （1）静态方法 

主要功能：            

    （1）模板功能                                                   

使用示例
-------


类说明
------

"""



####### 载入程序包 ##########################################################
############################################################################



import os 
import sys
import alluxio



####### 算法应用功能具体实现类 ##############################################
### 设计模式：                                                           ###
### （1）无                                                              ###
### 关键点：                                                             ###
### （1）静态方法                                                        ###
### 主要功能：                                                           ###
### （1）模板功能                                                        ###
############################################################################



###### 算法应用组件具体实现函数 #####################################################################
###################################################################################################
def generate_execute_file(self,cmd):
    """
    函数功能：

        定义一个根据模板文件和配置文件生成具体执行文件的函数

    参数：
        cmd (str): 命令行字符串

    返回：
        无
    """

    # 'python D:\\AEwork\\algorithm_platform\\Kyrios\\Demo\\Kyrios\\Foundation\\Function\\hydra_main.py +db=mysql +algorithm=ai_1'
    os.system(cmd)



def generate_alluxio_client(self,host,port):
    """
    函数功能：

        定义一个返回Alluxio客户端的函数

    参数：
        host (str): 主机地址
        port (int): 端口号

    返回：
        alluxio_client (Object): Alluxio客户端对象
    """

    alluxio_client = alluxio.Client(host = host,port = port)
    
    return alluxio_client



###### 算法应用组件具体实现接口类 #####################################################################
#####################################################################################################



class HydraInterface(object):
    """
    类介绍：

        这是一个Hydra动态配置的接口类
    """



    @staticmethod
    def generate_execute_file(cmd):
        """
        方法功能：

            定义一个根据模板文件和配置文件生成具体执行文件的接口
        """

        # 'python D:\\AEwork\\algorithm_platform\\Kyrios\\Demo\\Kyrios\\Foundation\\Function\\hydra_main.py +db=mysql +algorithm=ai_1'
        os.system(cmd)



###############################################################################################################################################
###############################################################################################################################################


